ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/captio.xml
<module id="CAPTIO" HW_revision=""><register id="CTL" width="16" offset="0xE" internal="0" description="Capacitive Touch IO x Control Register"><bitfield id="PISELx" description="Capacitive Touch IO pin select" begin="3" end="1" width="3" rwaccess="R/W"><bitenum id="PISEL__0" value="0" description="Px.0"/><bitenum id="PISEL__1" value="1" description="Px.1"/><bitenum id="PISEL__2" value="2" description="Px.2"/><bitenum id="PISEL__3" value="3" description="Px.3"/><bitenum id="PISEL__4" value="4" description="Px.4"/><bitenum id="PISEL__5" value="5" description="Px.5"/><bitenum id="PISEL__6" value="6" description="Px.6"/><bitenum id="PISEL__7" value="7" description="Px.7"/></bitfield><bitfield id="POSELx" description="Capacitive Touch IO port select" begin="7" end="4" width="4" rwaccess="R/W"><bitenum id="POSEL__0" value="0" description="Px = PJ"/><bitenum id="POSEL__1" value="1" description="Px = P1"/><bitenum id="POSEL__2" value="2" description="Px = P2"/><bitenum id="POSEL__3" value="3" description="Px = P3"/><bitenum id="POSEL__4" value="4" description="Px = P4"/><bitenum id="POSEL__5" value="5" description="Px = P5"/><bitenum id="POSEL__6" value="6" description="Px = P6"/><bitenum id="POSEL__7" value="7" description="Px = P7"/><bitenum id="POSEL__8" value="8" description="Px = P8"/><bitenum id="POSEL__9" value="9" description="Px = P9"/><bitenum id="POSEL__16" value="10" description="Px = P10"/><bitenum id="POSEL__17" value="11" description="Px = P11"/><bitenum id="POSEL__18" value="12" description="Px = P12"/><bitenum id="POSEL__19" value="13" description="Px = P13"/><bitenum id="POSEL__20" value="14" description="Px = P14"/><bitenum id="POSEL__21" value="15" description="Px = P15"/></bitfield><bitfield id="EN" description="Capacitive Touch IO enable" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="EN__0" value="0" description="All Capacitive Touch IOs are disabled"/><bitenum id="EN__1" value="1" description="Selected Capacitive Touch IO is enabled"/></bitfield><bitfield id="STATE" description="Capacitive Touch IO state" begin="9" end="9" width="1" rwaccess="R/W"><bitenum id="STATE__0" value="0" description="Curent state 0 or Capacitive Touch IO is disabled"/><bitenum id="STATE__1" value="1" description="Current state 1"/></bitfield></register></module>